Documents/бит_СвидетельствоОРегистрацииПоМестуПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СвидетельствоОРегистрацииПоМестуПребывания</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_СвидетельствоОРегистрацииПоМестуПребывания/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 09.09.2014
	Если Параметры.Основание <> Неопределено Тогда
		Отказ = Объект.ЗапретитьВвод;	
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2014
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ЭтоНовый = ?(Параметры.Ключ.Пустая(), Истина, Ложь);
	
	Если ЭтоНовый И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда  
		
		// БИТ_ЖКХ 10.02.2014
		
		// Объект.Организация 		= глЗначениеПеременной("ОсновнаяОрганизация");.	
		// Объект.Ответственный 	= глЗначениеПеременной("глТекущийПользователь");.
		Объект.Организация 		= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");	
		Объект.Ответственный 	= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		// БИТ_ЖКХ 10.02.2014
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// БИТ_ЖКХ 09.09.2014
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		
		Попытка
			Если Объект.ДатаРегистрации <> ЭтаФорма.ВладелецФормы.Объект.ДатаРегистрации 
				Или Объект.ДатаСнятияСРегистрации <> ЭтаФорма.ВладелецФормы.Объект.ДатаСнятияСРегистрации
				Или Объект.ЛицевойСчет <> ЭтаФорма.ВладелецФормы.Объект.ЛицевойСчет
				Или Объект.РегистрируемоеЛицо <> ЭтаФорма.ВладелецФормы.Объект.РегистрируемоеЛицо Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выдано свидетельство о регистрации с другими данными, необходимо удалить свидетельство и создать новое для изменения данных");
				
				Элементы.Печать.Видимость = Ложь;
				
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2014
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// БИТ_ЖКХ 09.09.2014
	Оповестить("ДокументЗаписан");
	// БИТ_ЖКХ 09.09.2014
	
КонецПроцедуры // ПослеЗаписи()

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	Если Модифицированность ИЛИ Параметры.Ключ.Пустая() Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект), "Данные еще не записаны.
		|Печать возможна только после записи данных.                         
		|Данные будут записаны.", РежимДиалогаВопрос.ДаНет);
		Возврат; 
		
	КонецЕсли; 
	
	// БИТ_ЖКХ_30012014_начало_изменений
	//Результат = Документы.бит_СвидетельствоОРегистрацииПоМестуПребывания.Печать(Параметры.Ключ);
	ПечатьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
	Иначе
		Возврат;
	КонецЕсли; 
	
	ПечатьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьФрагмент()
	
	Перем АдресТабличногоДокументаВоВременномХранилище, Результат;
	
	Результат = ПолучитьРезультат(Параметры.Ключ);

	Если Результат.НетОшибок Тогда
		АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат.ТабДокумент, АдресТабличногоДокументаВоВременномХранилище);
		
		бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
		,"бит_СвидетельствоОРегистрацииПоМестуПребывания"
		,"СОРПМЖ"
		,"Ф3:Свидетельство о регистрации по месту пребывания"
		
		,АдресТабличногоДокументаВоВременномХранилище
		
		,Объект.Ссылка);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьФрагментДубликат()
	
	Перем АдресТабличногоДокументаВоВременномХранилище, Результат;
	
	Результат = ПолучитьРезультатДубликат(Параметры.Ключ);

	Если Результат.НетОшибок Тогда
		АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат.ТабДокумент, АдресТабличногоДокументаВоВременномХранилище);
		
		бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
		,"бит_СвидетельствоОРегистрацииПоМестуПребывания"
		,"СОРПМЖ_ДУБЛИКАТ"
		,"Ф3:Свидетельство о регистрации по месту пребывания дубликат"
		
		,АдресТабличногоДокументаВоВременномХранилище
		
		,Объект.Ссылка);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ЛицевойСчет.Пустая();
	Объект.Ответственный.Пустая();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	Документ       = Метаданные.Документы.бит_СвидетельствоОРегистрацииПоМестуПребывания;
	ПравоИзменения = ПравоДоступа("Изменение", Документ);
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	// КэшПеречисления = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("ПравоИзменения"      , ПравоИзменения);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

	   &НаСервере
Функция ПолучитьИнициалы(Строка)
	
	Если НЕ ПустаяСтрока(Строка) Тогда
		
		Если СтрНайти(Строка, ".") Тогда
			Возврат Строка;
		КонецЕсли;
		
		ФИО = СтрРазделить(Строка, " ", Ложь);
		
		Отчество = "";
		Фамилия = "";
		Имя = "";
		
		Если ФИО.Количество() = 3 Тогда
			Фамилия = ФИО[0];
			Имя = ФИО[1];
			Отчество = ФИО[2];
		ИначеЕсли ФИО.Количество() = 2 Тогда
			Фамилия = ФИО[0];
			Имя = ФИО[1];	
		Иначе
			Фамилия = ФИО[0];
		КонецЕсли;
		
		ФамилияИнициалы = Фамилия 
		+?(ЗначениеЗаполнено(Имя), " " + Лев(Имя,1), "") 
		+?(ЗначениеЗаполнено(Отчество),". " + Лев(Отчество,1)+".", ""); 	
		
		Возврат ФамилияИнициалы;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаКлиенте
Процедура РегистрируемоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", Новый Структура("ТекущаяСтрока", Объект.РегистрируемоеЛицо), Элемент); 
	
КонецПроцедуры

// БИТ_ЖКХ_30012014_начало_изменений
&НаСервере
Функция ПолучитьРезультат(Знач Ссылка)
			
	Возврат Документы.бит_СвидетельствоОРегистрацииПоМестуПребывания.Печать(Ссылка);
	
КонецФункции

&НаСервере
Функция ПолучитьРезультатДубликат(Знач Ссылка)
	
	Возврат Документы.бит_СвидетельствоОРегистрацииПоМестуПребывания.ПечатьСОРПМЖДубликат(Ссылка);

КонецФункции

// БИТ_ЖКХ_30012014_окончание_изменений

// БИТ_ЖКХ 09.09.2014
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:58:53 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:58:53 Конец правки.
	
	Оповестить("Закрытие");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДубликат(Команда)
	ПечатьФрагментДубликат();
КонецПроцедуры
// БИТ_ЖКХ 09.09.2014

#КонецОбласти
